#ifndef USB_USB_H
#define USB_USB_H

#include <FreeRTOS.h>
#include <event_groups.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <uchar.h>

/**
 * \ingroup UEP
 * \brief The maximum endpoint number supported by the stack.
 *
 * This value is limited by the STM32F4’s hardware
 */
#define UEP_MAX_ENDPOINT 3U

/**
 * \ingroup UEP
 * \brief Extracts and returns only the endpoint number part of an endpoint address.
 */
#define UEP_NUM(x) ((x)&0x7FU)

/**
 * \ingroup UEP
 * \brief Extracts only the direction part of an endpoint address and returns it as 1 for
 * IN or 0 for OUT
 */
#define UEP_DIR(x) ((x) >> 7U)

/**
 * \ingroup UEP
 * \brief Converts an endpoint address into an index number, suitable for use to index an
 * array or bit mask.
 *
 * If the array has length (\ref UEP_MAX_ENDPOINT × 2), then this macro can be used to
 * select a unique array element per endpoint address.
 */
#define UEP_IDX(x) ((UEP_NUM(x) - 1U) + (UEP_DIR(x) * UEP_MAX_ENDPOINT))



/**
 * \defgroup STD USB standard types and constants
 *
 * These data structures and constants match values defined in the USB specification.
 *
 * \{
 */

/**
 * \brief Standard control requests for \ref usb_setup_packet_t::bRequest.
 */
typedef enum
{
    USB_CREQ_GET_STATUS        = 0,
    USB_CREQ_CLEAR_FEATURE     = 1,
    USB_CREQ_SET_FEATURE       = 3,
    USB_CREQ_SET_ADDRESS       = 5,
    USB_CREQ_GET_DESCRIPTOR    = 6,
    USB_CREQ_SET_DESCRIPTOR    = 7,

    uint8_t bLength;            ///< The length of this descriptor (\c
                                ///< sizeof(usb_interface_association_descriptor_t))
    uint8_t bDescriptorType;    ///< The type of this descriptor (\ref usb_dtype_t
                                ///< "USB_DTYPE_INTERFACE_ASSOCIATION")
    uint8_t bFirstInterface;    ///< The first interface number in the association
    uint8_t bInterfaceCount;    ///< The number of interfaces in the association
    uint8_t bFunctionClass;     ///< The class of the function in the association
    uint8_t bFunctionSubClass;  ///< The subclass of the function in the association
    uint8_t bFunctionProtocol;  ///< The protocol of the function in the association
    uint8_t iFunction;  ///< The string index of the function’s name, or 0 to omit
} usb_interface_association_descriptor_t;

/**
 * \brief The payload of a SETUP transaction.
 */
typedef struct __attribute__((packed))
{
    struct __attribute__((packed))
    {
        usb_recipient_t recipient : 5;  ///< The type of entity to which the control
                                        ///< transfer is addressed
        usb_ctype_t type : 2;  ///< The level of standard which specifies the behaviour of
                               ///< the control transfer
        unsigned direction : 1;  ///< 1 if the data stage (if any) will be IN, or 0 if OUT
    } bmRequestType;             ///< Miscellaneous attributes of the control transfer
    uint8_t bRequest;            ///< The specific request being made
    uint16_t wValue;  ///< A general-purpose parameter whose meaning is request-specific
    uint16_t
        wIndex;  ///< For \ref usb_recipient_t "USB_RECIPIENT_ENDPOINT", generally a
                 ///< device address; for \ref usb_recipient_t "USB_RECIPIENT_INTERFACE",
                 ///< generally an interface number; otherwise, a general-purpose
                 ///< parameter whose meaning is request-specific
    uint16_t wLength;  ///< For \ref direction set, the maximum number of bytes the host
                       ///< will accept in the data stage; otherwise, the exact number of
                       ///< bytes the host will send in the data stage
} usb_setup_packet_t;

/**
 * \brief Evaluates to a struct initializer for a \ref usb_string_descriptor_t for a given
 * string.
 *
 * One might use this macro as follows:
 * \code
 * static const usb_string_descriptor_t GREETING_EN_CA =
 * USB_STRING_DESCRIPTOR_INITIALIZER(u"Hello World!"); \endcode
 *
 * \param[in] text the string literal to initialize with, which should be UTF-16
 */
#define USB_STRING_DESCRIPTOR_INITIALIZER(text)                                          \
    {                                                                                    \
        .bLength = sizeof(usb_string_descriptor_t) + sizeof((text)) - sizeof(char16_t),  \
        .bDescriptorType = USB_DTYPE_STRING, .bString = (text)                           \
    }

/**
 * \cond HIDDEN
 */
_Static_assert(sizeof(usb_device_descriptor_t) == 18,
               "usb_device_descriptor_t wrong size");
_Static_assert(sizeof(usb_configuration_descriptor_t) == 9,
               "usb_configuration_descriptor_t wrong size");
_Static_assert(sizeof(usb_interface_descriptor_t) == 9,
               "usb_interface_descriptor_t wrong size");
_Static_assert(sizeof(usb_endpoint_descriptor_t) == 7,
               "usb_endpoint_descriptor_t wrong size");
_Static_assert(sizeof(usb_string_descriptor_t) == 2,
               "usb_string_descriptor_t wrong size");
_Static_assert(sizeof(usb_string_zero_descriptor_t) == 2,
               "usb_string_zero_descriptor_t wrong size");
_Static_assert(sizeof(usb_interface_association_descriptor_t) == 8,
               "usb_interface_association_descriptor_t wrong size");
_Static_assert(sizeof(usb_setup_packet_t) == 8, "usb_setup_packet_t wrong size");
/**
 * \endcond
 */

/**
 * \}
 */



/**
 * \defgroup CONF Configuration tables
 *
 * These data structures define the configuration tables that define device operation.
 * An application must define, in memory (typically Flash, marked \c const), an instance
 * of \ref udev_info_t and pass it to \ref udev_init. The USB stack uses this structure to
 * find all the device’s descriptors, callbacks, and other information it needs.
 *
 * \{
 */

/**
 * \brief Callbacks for an endpoint.
 *
 * When an endpoint callback is needed, the stack searches for the single most-specific
 * instance of this structure. If the alternate setting containing the endpoint has an
 * info block for the endpoint, that instance will be used. Otherwise, if the interface
 * has an info block, that will be used. Otherwise, if the configuration has an info
 * block, that will be used. Otherwise, no info block will be used.
 *
